configuration/src/InformationRegisters/НастройкиПереходаСтатусовОбъектов/НастройкиПереходаСтатусовОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПереходаСтатусовОбъектов</name>
  <comment>Настройки очередности перехода статусов объектов и их доступность по ролям пользователей</comment>
  <resources>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <comment>Объект, для которого настраивается переход</comment>
    <type>
      <types>CatalogRef.ТипыОбъектовВладельцев</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТекущийСтатус</name>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РольПользователя</name>
    <type>
      <types>CatalogRef.РолиПользователей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НовыйСтатус</name>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Catalogs/СтатусыОбъектов/СтатусыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатусыОбъектов</name>
  <comment>Хранит  элементы, соответствующие определенным статусам объектов.</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>CodeReview</name>
      <description>Code review</description>
    </items>
    <items>
      <name>DesignReview</name>
      <description>Design review</description>
    </items>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>ВРеализацию</name>
      <description>В реализацию</description>
    </items>
    <items>
      <name>Внедрение</name>
      <description>Внедрение</description>
    </items>
    <items>
      <name>ВнутреннееТестирование</name>
      <description>Внутреннее тестирование</description>
    </items>
    <items>
      <name>Документирование</name>
      <description>Документирование</description>
    </items>
    <items>
      <name>ЗапросТребований</name>
      <description>Запрос требований</description>
    </items>
    <items>
      <name>Масштабирование</name>
      <description>Масштабирование</description>
    </items>
    <items>
      <name>НаДоработку</name>
      <description>На доработку</description>
    </items>
    <items>
      <name>Рассмотрение</name>
      <description>На рассмотрении</description>
    </items>
    <items>
      <name>Новый</name>
      <description>Новый</description>
    </items>
    <items>
      <name>Отклонен</name>
      <description>Отклонен</description>
    </items>
    <items>
      <name>Отложен</name>
      <description>Отложен</description>
    </items>
    <items>
      <name>Приостановлен</name>
      <description>Приостановлен</description>
    </items>
    <items>
      <name>Проработка</name>
      <description>Проработка</description>
    </items>
    <items>
      <name>Протестирован</name>
      <description>Протестирован</description>
    </items>
    <items>
      <name>Публикация</name>
      <description>Публикация</description>
    </items>
    <items>
      <name>Рассмотрен</name>
      <description>Рассмотрен</description>
    </items>
    <items>
      <name>РевьюТребований</name>
      <description>Ревью требований</description>
    </items>
    <items>
      <name>Решен</name>
      <description>Решен</description>
    </items>
    <items>
      <name>Тестирование</name>
      <description>Тестирование</description>
    </items>
  </predefined>
  <attributes>
    <name>ИмяКартинкиВБиблиотеке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЗафиксирован</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс изображения в общей картинке СтатусыОбъектов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <comment>Порядковый номер статуса</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПричиныИзмененияСтатуса</name>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.ПричиныИзмененияСтатусов</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Catalogs/РолиПользователей/РолиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РолиПользователей</name>
  <comment>Список возможных ролей пользователя</comment>
  <predefined>
    <items>
      <name>Аналитик</name>
      <description>Аналитик</description>
    </items>
    <items>
      <name>ВсеРоли</name>
      <description>Все роли</description>
    </items>
    <items>
      <name>Гость</name>
      <description>Гость</description>
    </items>
    <items>
      <name>ДиректорIT</name>
      <description>Директор IT</description>
    </items>
    <items>
      <name>Заказчик</name>
      <description>Заказчик</description>
    </items>
    <items>
      <name>Разработчик</name>
      <description>Разработчик</description>
    </items>
    <items>
      <name>РуководительIT</name>
      <description>Руководитель ИТ-отдела</description>
    </items>
    <items>
      <name>РуководительНаправления</name>
      <description>Руководитель направления</description>
    </items>
    <items>
      <name>РуководительНаправленияIT</name>
      <description>Руководитель направления IT</description>
    </items>
    <items>
      <name>СтаршийРазработчик</name>
      <description>Старший разработчик</description>
    </items>
    <items>
      <name>СТО</name>
      <description>СТО</description>
    </items>
    <items>
      <name>Тестировщик</name>
      <description>Тестировщик</description>
    </items>
  </predefined>
  <attributes>
    <name>ПринадлежитITОтделу</name>
    <comment>Истина - определяет роль пользователя в IT-структуре, Ложь - роль пользователя по отношению к объектам</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеИнструменты</name>
    <attributes>
      <name>Инструмент</name>
      <type>
        <types>CatalogRef.ИнструментыСистемы</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоОтчет</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/InformationRegisters/НастройкиПереходаСтатусовОбъектов/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ВнешнееСоединение ИЛИ ТолстыйКлиентОбычноеПриложение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет обработчики обновления
//
// Параметры:
//  Обработчики	 - ТаблицаЗначений	 - см. ПриложениеВызовСервера.ПолучитьОбработчикиДанных
//
Процедура ДобавлениеОбработчиковОбновления(Обработчики) Экспорт     
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "РегистрыСведений.НастройкиПереходаСтатусовОбъектов.ПроверитьПредопределенныеНастройки";
	
КонецПроцедуры

// Формирует список статусов для типа объекта, в которые возможен переход согласно настройке по-умолчанию
//
// Параметры:
//  ТипОбъекта	 - СправочникСсылка.ТипыОбъектовВладельцев	 - тип объекта, к которому относится статус
//  ВернутьСписокЗначений	 - Булево	 - если Истина - вернет список значений, если Ложь - массив ссылок
// 
// Возвращаемое значение:
//  СписокЗначений, Массив - набор статусов процесса филиала
//
Функция ПолучитьСтатусыПоУмолчанию(Знач ТипОбъекта, Знач ВернутьСписокЗначений = Истина) Экспорт
	
	Если ВернутьСписокЗначений Тогда
		Результат = Новый СписокЗначений;
	Иначе
		Результат = Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтатусыОбъектов.Ссылка КАК Ссылка,
	|	СтатусыОбъектов.Наименование КАК Наименование,
	|	СтатусыОбъектов.ИмяКартинкиВБиблиотеке КАК ИмяКартинки,
	|	СтатусыОбъектов.Порядок КАК Порядок
	|ИЗ
	|	РегистрСведений.НастройкиПереходаСтатусовОбъектов КАК НастройкиПереходаСтатусовОбъектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтатусыОбъектов КАК СтатусыОбъектов
	|		ПО НастройкиПереходаСтатусовОбъектов.ТекущийСтатус = СтатусыОбъектов.Ссылка
	|ГДЕ
	|	НастройкиПереходаСтатусовОбъектов.Объект = &Объект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтатусыОбъектов.Ссылка,
	|	СтатусыОбъектов.Наименование,
	|	СтатусыОбъектов.ИмяКартинкиВБиблиотеке,
	|	СтатусыОбъектов.Порядок
	|ИЗ
	|	Справочник.СтатусыОбъектов КАК СтатусыОбъектов
	|ГДЕ
	|	СтатусыОбъектов.Ссылка = ЗНАЧЕНИЕ(Справочник.СтатусыОбъектов.Решен)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	
	Запрос.УстановитьПараметр("Объект", ТипОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ВернутьСписокЗначений Тогда
				ИмяКартинки = СтрШаблон("Статус%1", Выборка.ИмяКартинки);
				
				НовыйЭлемент = Результат.Добавить();
				НовыйЭлемент.Значение = Выборка.Ссылка;
				НовыйЭлемент.Представление = Выборка.Наименование;
				НовыйЭлемент.Картинка = БиблиотекаКартинок[ИмяКартинки];
			Иначе
				Результат.Добавить(Выборка.Ссылка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет предопределенные настройки
//
Процедура ПроверитьПредопределенныеНастройки() Экспорт
	
	ТипОбъекта = "Справочник_Проекты";
	РольПользователя = "ВсеРоли";
	
	ЗаполнитьНастройку(ТипОбъекта, РольПользователя, "Новый", "Рассмотрение", 1);
	ЗаполнитьНастройку(ТипОбъекта, РольПользователя, "Новый", "Отклонен", 2);
	ЗаполнитьНастройку(ТипОбъекта, РольПользователя, "Рассмотрение", "ВРаботе", 1);
	ЗаполнитьНастройку(ТипОбъекта, РольПользователя, "Рассмотрение", "Отклонен", 2);
	ЗаполнитьНастройку(ТипОбъекта, РольПользователя, "ВРаботе", "Тестирование", 1);
	ЗаполнитьНастройку(ТипОбъекта, РольПользователя, "ВРаботе", "Приостановлен", 1);
	ЗаполнитьНастройку(ТипОбъекта, РольПользователя, "ВРаботе", "Отклонен", 3);
	ЗаполнитьНастройку(ТипОбъекта, РольПользователя, "Приостановлен", "ВРаботе", 1);
	ЗаполнитьНастройку(ТипОбъекта, РольПользователя, "Тестирование", "ВРаботе", 1);
	ЗаполнитьНастройку(ТипОбъекта, РольПользователя, "Тестирование", "Масштабирование", 2);
	ЗаполнитьНастройку(ТипОбъекта, РольПользователя, "Тестирование", "Решен", 3);
	ЗаполнитьНастройку(ТипОбъекта, РольПользователя, "Масштабирование", "Решен", 1);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции  

Процедура ЗаполнитьНастройку(ИмяЭлемента, Знач РольПользователя, Знач ТекущийСтатус, Знач НовыйСтатус, Знач Порядок);
	
	Попытка
		Объект = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ТипыОбъектовВладельцев." + ИмяЭлемента);
	Исключение
		Сообщение = НСтр("ru = 'Предопределенный элемент ""%Параметр%"" не найден.'");
		Сообщение = СтрЗаменить(Сообщение, "%Параметр%", "Справочник.ТипыОбъектовВладельцев." + ИмяЭлемента);
		ВызватьИсключение Сообщение;
	КонецПопытки;
	
	Попытка
		ТекущийСтатус = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.СтатусыОбъектов." + ТекущийСтатус);
	Исключение
		Сообщение = НСтр("ru = 'Предопределенный элемент ""%Параметр%"" не найден.'");
		Сообщение = СтрЗаменить(Сообщение, "%Параметр%", "Справочник.СтатусыОбъектов." + ТекущийСтатус);
		ВызватьИсключение Сообщение;
	КонецПопытки; 
	
	Попытка
		НовыйСтатус = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.СтатусыОбъектов." + НовыйСтатус);
	Исключение
		Сообщение = НСтр("ru = 'Предопределенный элемент ""%Параметр%"" не найден.'");
		Сообщение = СтрЗаменить(Сообщение, "%Параметр%", "Справочник.СтатусыОбъектов." + НовыйСтатус);
		ВызватьИсключение Сообщение;
	КонецПопытки;
	
	Попытка
		РольПользователя = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.РолиПользователей." + РольПользователя);
	Исключение
		Сообщение = НСтр("ru = 'Предопределенный элемент ""%Параметр%"" не найден.'");
		Сообщение = СтрЗаменить(Сообщение, "%Параметр%", "Справочник.РолиПользователей." + РольПользователя);
		ВызватьИсключение Сообщение;
	КонецПопытки;
		
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Объект.Установить(Объект);
	Набор.Отбор.ТекущийСтатус.Установить(ТекущийСтатус);
	Набор.Отбор.РольПользователя.Установить(РольПользователя);
	Набор.Отбор.НовыйСтатус.Установить(НовыйСтатус);
	Набор.Прочитать();
	
	Если Набор.Количество() = 0 Тогда	
		Запись = Набор.Добавить();
		Запись.Объект = Объект;
		Запись.ТекущийСтатус = ТекущийСтатус;
		Запись.РольПользователя = РольПользователя;
		Запись.НовыйСтатус = НовыйСтатус;
		Запись.Порядок = Порядок;
		Набор.Записать();               
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
